{
  "professional_highlights": [
    "Delivered exceptional customer experiences using strong communication, high emotional intelligence, and upselling strategies to drive sales and foster loyalty.",
    "Proven leadership and team management skills with integrity and accountability, capable of staff training and ensuring consistent, strong in-store performance.",
    "Expertise in Flooring Knowledge & Product Familiarity combined with Visual Merchandising & Display Setup for practical customer guidance and premium store presentation.",
    "Organized, disciplined, and detail-oriented approach ensures accuracy in estimates, orders, and professional POS Operation & Cash Handling.",
    "Bilingual communication (English/A2 French), enabling clear, customer-focused interactions with a diverse clientele."
  ],
  "work_experience": [
    {
      "job_title": "Flooring Installer",
      "company": "Wael Flooring Ltd.",
      "from": "Dec 2024",
      "to": "Now",
      "achievements": [
        "Managed installation projects across multiple units and properties, completing over 11,000 sq ft of laminate and vinyl and 5,000 sq ft of carpet tile within tight deadlines.",
        "Prepared and levelled floors, ensuring surfaces were clean, smooth, and ready for precise laminate, vinyl, or carpet installation.",
        "Measured, cut, and fitted materials with accuracy to achieve a seamless, high-quality finish that met client specifications.",
        "Provided team headcount updates and progress reports to ensure on-schedule completion.",
        "Received and organized biweekly material deliveries—including underlayment, laminate, vinyl, carpet, adhesives, and transitions—ensuring proper handling and inventory control.",
        "Maintained a safe, clean, and hazard-free workspace, demonstrating professionalism and accountability in shared construction environments.",
        "Built strong on-site relationships with contractors and supervisors through reliability, communication, and attention to detail, reinforcing client trust and satisfaction."
      ]
    },
    {
      "job_title": "Assistant Store Manager",
      "company": "RW&CO",
      "from": "Nov 2022",
      "to": "Nov 2024",
      "achievements": [
        "Directed all aspects of daily store operations, including sales performance, merchandising, scheduling, and inventory control.",
        "Led a team of 10+ associates, fostering a customer-focused culture that consistently exceeded sales and service targets.",
        "Analyzed sales reports and market trends to develop strategies that boosted monthly revenue and improved product sell-through.",
        "Maintained an 80% average capture rate for the RW Insider program—surpassing company benchmarks through active client engagement.",
        "Provided hands-on coaching to enhance team confidence, upselling skills, and conversion rates during key sales segments.",
        "Built loyal client relationships that increased repeat business and positive customer feedback.",
        "Upheld company standards for loss prevention, health and safety, and visual presentation."
      ]
    },
    {
      "job_title": "Team Lead",
      "company": "RW&CO",
      "from": "Oct 2021",
      "to": "Nov 2022",
      "achievements": [
        "Served as acting manager in the absence of management, directing daily store operations and ensuring smooth execution of all promotions, visuals, and sales activities.",
        "Acted as the first point of contact for staff concerns or operational issues, resolving matters independently and escalating only when necessary.",
        "Assisted management in developing and implementing sales strategies, promotional plans, and scheduling adjustments to maximize results.",
        "Fostered a positive, supportive environment that maintained high morale, teamwork, and consistent customer service excellence."
      ]
    },
    {
      "job_title": "Sales Associate / Key Holder",
      "company": "RW&CO",
      "from": "Apr 2018",
      "to": "Oct 2021",
      "achievements": [
        "Welcomed and engaged every customer at the entrance, clearly communicating in-store promotions and driving traffic toward key product areas.",
        "Assisted customers with fitting rooms, provided tailored recommendations, and upsold promotional items to increase overall transaction value.",
        "Operated POS system and performed accurate cash reconciliation, along with opening and closing responsibilities as a key holder.",
        "Trained and guided new employees through onboarding, shadowing, and customer interaction best practices to maintain service standards.",
        "Contributed to strong daily sales performance and seamless team coordination in a fast-paced retail environment."
      ]
    }
  ],
  "education": [
    {
      "institution": "Kwantlen Polytechnic University",
      "degree": "Diploma in General Studies",
      "from": "Jan 2018",
      "to": "Aug 2021"
    }
  ]
}
